{
    "sent_date": "Sun, 4 Aug 2024 18:38:33 +0530 (IST)",
    "from_email": "Naukri Alerts <naukrialerts@naukri.com>",
    "to_email": "Ashok Singh <ashoksinghcs@gmail.com>",
    "subject": "Ashok Singh, Unlock Your Potential: Jobs you might have missed this week",
    "mail_text": "Contus Tech is Hiring!!- Python Developer || Chennai Seize all job opportunities of this week! Contus Tech is Hiring!!- Python Developer || Chennai CONTUS TECH 4.3 Chennai I Python Developer with AWS Cloud Idc Engineering 3.9 Hybrid - Chennai,... A Python Software Developer Abacus Staffing and... Hybrid - Chennai,... Are these jobs relevant? Yes No T Senior Software Engineer - Python+Databricks Tekting Private Limited Hybrid - Bengaluru C R&D Expert - NLP / Machine Learning - Java / C# / C++ / Python / Perl Career Maker Bengaluru B Senior Python Developer Buildingblocks Soft... 4.3 Chennai Women candidates preferred Python (Programming Language)- Pan India Mount Talent Consulting Pune, Delhi NCR, ... Python Developer Techwave Consulting 3.8 Hybrid - Hyderabad Python API Lead Applied Materials 4.0 Chennai Python Pyspark Developer Amantya Technologies 3.8 Bengaluru P Python Developer Precisiontech Globa... Hybrid - Hyderabad N Python Software Developer NR Consulting Chennai, Hyderabad Senior Software Engineer - Python Talent Sprint 4.1 Hyderabad N Python Developer Lead Nithminds Bengaluru, Hyderabad Python Developer (React JS) Live Connections Bengaluru View All Recommendations Applies are a click away on the Naukri app Available on Get App Scan to download Unsubscribe Report a Problem You have received this mail because your e-mail ID is registered with Naukri.com. This is a system-generated e-mail regarding your Naukri account preferences, please don't reply to this message. The jobs sent in this mail have been posted by the clients of Naukri.com. And we have enabled auto-login for your convenience, you are strongly advised not to forward this email to protect your account from unauthorized access. IEIL has taken all reasonable steps to ensure that the information in this mailer is authentic. Users are advised to research bonafides of advertisers independently. Please do not pay any money to anyone who promises to find you a job. IEIL shall not have any responsibility in this regard. We recommend that you visit our Terms & Conditions and the Security Advice for more comprehensive information."
}