{
    "sent_date": "Fri, 25 Oct 2024 07:31:03 +0530 (IST)",
    "from_email": "Nallas Corporation <karthiccbmFsbGFzLmNvbQ==@naukri.com>",
    "to_email": "Ashok Singh <ashoksinghcs@gmail.com>",
    "subject": "✉️ Job | Python Developer in Hyderabad, Bengaluru, Chennai",
    "mail_text": "Job invite from recruiter. Apply now! You've been chosen from a large pool of jobseekers to apply for this job. Make the most of this opportunity and stay ahead in your job search. Get app Ashok Singh, you're invited to apply to this job Nallas Corporation 4.2 (48 Reviews) Python Developer Hyderabad, Bengaluru, Chennai 5 - 10 years 11.0 lacs - 21.0 lacs In office Python, Flask, Django, Pytest, AWS, Kafka, Rabbitmq, Mqtt, HTTP Apply now Job description Responsibilities: Design, develop, and maintain Python-based applications, APIs, and services that meet business requirements and adhere to best practices. Collaborate with software architects and development teams to design scalable and efficient solutions that align with project goals and technical specifications. Write clean, maintainable, and reusable code following established coding standards and software development methodologies. Conduct code reviews, provide constructive feedback, and mentor junior team members to promote code quality and professional growth. Identify and address technical debt, performance bottlenecks, and other software-related issues through proactive troubleshooting and optimization. Integrate third-party libraries, frameworks, and tools to enhance application functionality and streamline development workflows. Participate in agile development processes, including sprint planning, daily stand-ups, and retrospectives, to ensure timely delivery of features and enhancements. Qualifications: Bachelor's degree in Computer Science, Engineering, or related field; Master's degree preferred. Proven experience (5 to 8 years) as a Python Developer or similar role, with a strong portfolio of Python-based projects and applications. Proficiency in Python programming language and its standard libraries, frameworks, and tools such as Numpy, Scipy, Pandas, Dask, spaCy, NLTK, sci-kit-learn and PyTorch Experience REST API libraries and frameworks such as Django, Flask, SQLAlchemy. Solid understanding of object-oriented programming (OOP) principles, data structures, and algorithms. Experience with database design, SQL, and ORM frameworks (e.g., SQLAlchemy, Django ORM). Familiarity with front-end technologies such as HTML, CSS, JavaScript, and client-side frameworks (e.g., React, Angular, Vue.js). Knowledge of version control systems (e.g., Git) and collaborative development workflows (e.g., GitHub, GitLab). Strong analytical and problem-solving skills, with a keen attention to detail and a passion for continuous improvement. Excellent communication and interpersonal skills, with the ability to collaborate effectively in a team environment and communicate technical concepts to non-technical stakeholders. Preferred Qualifications: Experience with cloud platforms and services (e.g., AWS, Azure, Google Cloud Platform). Knowledge of containerization and orchestration technologies (e.g., Docker, Kubernetes). Understanding of software testing principles and practices, including unit testing, integration testing, and test automation frameworks (e.g., pytest). Familiarity with DevOps practices and CI/CD pipelines for automated software deployment and delivery. You are receiving this e-mail because your profile contained one or more of the following words that the recruiter searched on : \"Python, Flask, Django, Pytest, AWS, Kafka, Rabbitmq, Mqtt, HTTP\" Apply now The sender of this email is registered with Naukri.com as Nallas Corporation (No. 6/93, Govt Hsc School Road, Muthugapatti, NAMAKKAL, Namakkal, Tamil Nadu, NAMAKKAL, Tamilnadu, India). The responsibility of checking the authenticity of offers/correspondence lies with you. If you consider the content of this email inappropriate or spam, forward this email to compliance@naukri.com. You can also block this recruiter from searching your resume. Applies are a click away on the Naukri app Available on Get App Scan to download Unsubscribe | Report a problem You have received this mail because your e-mail ID is registered with Naukri.com. This is a system-generated e-mail, please don't reply to this message. Please do not pay any money to anyone who promises to find you a job. IEIL shall not have any responsibility in this regard. We recommend that you visit our Terms & Conditions and the Security Advice for more information."
}